FILES/Documents/Услуга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>Услуга</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СведенияПоКомандировкам</xr:Item>
				<xr:Item>AccumulationRegister.ИнформацияПоСуммамУслуги</xr:Item>
				<xr:Item>InformationRegister.СвязанныеУслуги</xr:Item>
				<xr:Item>InformationRegister.КомиссииАгентств</xr:Item>
				<xr:Item>InformationRegister.РеквизитыХарактеристикаНоменклатуры</xr:Item>
				<xr:Item>InformationRegister.ИнформацияПоУслугеЭкстраполя</xr:Item>
				<xr:Item>InformationRegister.ХарактеристикаНоменклатурыРасшифровка</xr:Item>
				<xr:Item>InformationRegister.ПредставлениеКомандируемыхВУслугах</xr:Item>
				<xr:Item>InformationRegister.ИнформацияПоУслуге</xr:Item>
				<xr:Item>InformationRegister.УслугиДляЗаказовИзКорзины</xr:Item>
				<xr:Item>InformationRegister.ИсторияКомандированных</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВложеноВ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Услуга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорСПоставщиком</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказИзКорзины</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказИзКорзины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураБТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураБТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименованиеУслуги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДСБТ</v8:Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДСКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДСБТ</v8:Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДСКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДочернейУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипДочернейУслуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаВладелец</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Услуга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Командируемые</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Командируемый</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Командированные</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОписаниеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.НаборХарактеристикДляНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.НаборХарактеристикДляНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭкстраПоля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.НаборХарактеристикДляЭкстраПолей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.НаборХарактеристикДляЭкстраПолей</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Услуга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FILES/CommonForms/ФормаОтбора/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьНовоеУсловие()
	
	//ДЗ = ДанныеФормыВЗначение(Список.Отбор, Тип("ОтборКомпоновкиДанных"));
	ОбъектXDTO = СериализаторXDTO.ЗаписатьXDTO(Список.Отбор);
	
	Попытка
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьJSON(ЗаписьJSON, ОбъектXDTO);
		Стр = ЗаписьJSON.Закрыть(); 
	Исключение
		ЗаписьJSON = Новый ЗаписьXML;
		ЗаписьJSON.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьXML(ЗаписьJSON, ОбъектXDTO);
		Стр = ЗаписьJSON.Закрыть(); 
	КонецПопытки;
	
	Возврат Стр; 
КонецФункции

&НаСервере
Функция ПолучитьПредставление()
	Возврат Строка(Список.Отбор);
КонецФункции

&НаКлиенте
Процедура СоздатьПравилоИЗакрыть(Команда)
	
	Результат = Новый Структура("ДеревоПравил, Представление");
	Результат.ДеревоПравил = ПолучитьНовоеУсловие();
	Результат.Представление = ПолучитьПредставление();
	
	Закрыть(Результат);
КонецПроцедуры


Функция ПолучитьДеревоРекурсивно(ДЗ, ТекущиеЭлементы);
	
	Для Каждого ЭлементКомпоновки ИЗ ДЗ.Элементы Цикл 
		
		Если ТипЗнч(ЭлементКомпоновки) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ЭлементОтбора = ТекущиеЭлементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ЭлементОтбора.Использование = ЭлементКомпоновки.Использование;
			ЭлементОтбора.ТипГруппы = ЭлементКомпоновки.ТипГруппы;
			ПолучитьДеревоРекурсивно(ЭлементКомпоновки, ЭлементОтбора.Элементы);				
		Иначе					
			ЭлементОтбора = ТекущиеЭлементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = ЭлементКомпоновки.ЛевоеЗначение;   
			ЭлементОтбора.ВидСравнения = ЭлементКомпоновки.ВидСравнения;
			ЭлементОтбора.Использование = ЭлементКомпоновки.Использование;
			ЭлементОтбора.ПравоеЗначение = ЭлементКомпоновки.ПравоеЗначение;
		КонецЕсли;
		
	КонецЦикла;		
	//Возврат Дерево;
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтаФорма.Параметры.Свойство("ОбъектУсловия") Тогда
		Если ЗначениеЗаполнено(ЭтаФорма.Параметры.ОбъектУсловия) Тогда
			Список.ТекстЗапроса = УправлениеБТСервер.ПолучитьЗапросДляУсловий(ЭтаФорма.Параметры.ОбъектУсловия);
		Иначе
			Список.ТекстЗапроса = УправлениеБТСервер.ПолучитьЗапросДляУсловий();		
		КонецЕсли;
	Иначе	
		Список.ТекстЗапроса = УправлениеБТСервер.ПолучитьЗапросДляУсловий();		
	КонецЕсли;
	
	ТекстЗаглушки = УправлениеБТСервер.ПолучитьТекстЗаглушки();
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Документ.Услуга.ПустаяСсылка) КАК Ссылка,
	               |	УслугаОписаниеУслуги.Характеристика КАК Характеристика,
	               |	УслугаОписаниеУслуги.Значение КАК Значение
	               |ПОМЕСТИТЬ УслугаОписаниеУслугиВТ
	               |ИЗ
	               |	Документ.Услуга.ОписаниеУслуги КАК УслугаОписаниеУслуги
	               |ГДЕ
	               |	УслугаОписаниеУслуги.Ссылка = ЗНАЧЕНИЕ(Документ.Услуга.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Документ.Услуга.ПустаяСсылка) КАК Ссылка,
	               |	УслугаЭкстраПоля.Характеристика КАК Характеристика,
	               |	УслугаЭкстраПоля.Значение КАК Значение
	               |ПОМЕСТИТЬ УслугаЭкстраПоляВТ
	               |ИЗ
	               |	Документ.Услуга.ЭкстраПоля КАК УслугаЭкстраПоля
	               |ГДЕ
	               |	УслугаЭкстраПоля.Ссылка = ЗНАЧЕНИЕ(Документ.Услуга.ПустаяСсылка)
				   |;";
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, ТекстЗаглушки, ТекстЗапроса);
	
	
	//Для Каждого ЭлементДПО ИЗ Список.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.Элементы Цикл
	//	ОписаниеТипов = ЭлементДПО.ТипЗначения;
	//	МассивТипов = Новый Массив;
	//	МассивТипов.Добавить(Тип("СправочникСсылка.ЭлементОтбора"));
	//	НовоеОписаниеТипов = Новый ОписаниеТипов(ОписаниеТипов, МассивТипов);
	//	ЭлементДПО.ТипЗначения = Новый ОписаниеТипов(ОписаниеТипов, МассивТипов);
	//	
	//	//Список.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.Элементы.
	//	//ЭлементДПО.ТипЗначения.ПривестиЗначение(Справочники.ЭлементОтбора.ПустаяСсылка());
	//КонецЦикла;
	
	//Для Каждого ЭлементДПО ИЗ Список.Отбор.ДоступныеПоляОтбора.Элементы Цикл
	//	ЭлементДПО.ТипЗначения.Типы().Добавить(Тип("СправочникСсылка.ЭлементОтбора"));
	//	//ЭлементДПО.ТипЗначения.ПривестиЗначение(Справочники.ЭлементОтбора.ПустаяСсылка());
	//КонецЦикла;
	
	ДеревоПравил = "";
	ЭтаФорма.Параметры.Свойство("ДеревоПравил", ДеревоПравил);
	
	Если ЗначениеЗаполнено(ДеревоПравил) Тогда
		
		ЧтениеJSON = Новый ЧтениеJSON; 
		ЧтениеJSON.УстановитьСтроку(ДеревоПравил);
		ТипОбъектаXDTO = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data-composition-system/settings", "Filter");
		ОбъектXDTO = ФабрикаXDTO.ПрочитатьJSON(ЧтениеJSON,ТипОбъектаXDTO); 
		ОбъектXDTO.Проверить();
		
		ДЗ = СериализаторXDTO.ПрочитатьXDTO(ОбъектXDTO);
		ТекущиеЭлементы = Список.Отбор.Элементы;     //ТекущиеЭлементы = Новый ОтборКомпоновкиДанных;
		ПолучитьДеревоРекурсивно(ДЗ, ТекущиеЭлементы);
					
	КонецЕсли;
	
КонецПроцедуры

Процедура ПреобразоватьДЗВОтбор(ДЗ, Отбор)
	
	Если ДЗ.Строки.Количество()>0 Тогда
		
		Для Каждого ДЗСтрока ИЗ ДЗ.Строки Цикл
			
			Если ЗначениеЗаполнено(ДЗСтрока.ПравоеЗначениеНоменклатур) Тогда
				//Отбор	
				ПолеКомпоновкиДанных = Новый ПолеКомпоновкиДанных(ДЗСтрока.ЛевоеЗначение.ИмяПредопределенныхДанных+"Характеристика");
				НайденноеПоле = Отбор.ДоступныеПоляОтбора.НайтиПоле(ПолеКомпоновкиДанных); //Элементы[19].Заголовок
				Если (НайденноеПоле <> Неопределено) Тогда
					//Отбор.Элементы.Добавить(НайденноеПоле);
					ЭлементОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементОтбора.ЛевоеЗначение = НайденноеПоле.Поле;   
					ЭлементОтбора.ВидСравнения = ОтборКомпоновщика(ДЗСтрока.ВидСравнения);
					ЭлементОтбора.Использование = Истина;
					ЭлементОтбора.ПравоеЗначение = ДЗСтрока.ПравоеЗначениеНоменклатур;   
				КонецЕсли;
			Иначе
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОтборКомпоновщика(ОтборВидСравнения)
        
	Если ОтборВидСравнения = ВидСравнения.Больше Тогда
	    ОтборКомпоновщикаВидСравнения = ВидСравненияКомпоновкиДанных.Больше; 
		
    ИначеЕсли ОтборВидСравнения = ВидСравнения.БольшеИлиРавно Тогда
        ОтборКомпоновщикаВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		
	ИначеЕсли ОтборВидСравнения = ВидСравнения.ВИерархии Тогда
        ОтборКомпоновщикаВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
		
	ИначеЕсли ОтборВидСравнения = ВидСравнения.ВСписке Тогда
        ОтборКомпоновщикаВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		
	ИначеЕсли ОтборВидСравнения = ВидСравнения.ВСпискеПоИерархии Тогда
        ОтборКомпоновщикаВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
		
	ИначеЕсли ОтборВидСравнения = ВидСравнения.Меньше Тогда
		ОтборКомпоновщикаВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ИначеЕсли ОтборВидСравнения = ВидСравнения.МеньшеИлиРавно Тогда
		ОтборКомпоновщикаВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ИначеЕсли ОтборВидСравнения = ВидСравнения.НеВИерархии Тогда
		ОтборКомпоновщикаВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии;
	ИначеЕсли ОтборВидСравнения = ВидСравнения.НеВСписке Тогда
		ОтборКомпоновщикаВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ИначеЕсли ОтборВидСравнения = ВидСравнения.НеВСпискеПоИерархии Тогда
		ОтборКомпоновщикаВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии;
	ИначеЕсли ОтборВидСравнения = ВидСравнения.НеРавно Тогда
		ОтборКомпоновщикаВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ИначеЕсли ОтборВидСравнения = ВидСравнения.НеСодержит Тогда
		ОтборКомпоновщикаВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит;
	ИначеЕсли ОтборВидСравнения = ВидСравнения.Равно Тогда
		ОтборКомпоновщикаВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ИначеЕсли ОтборВидСравнения = ВидСравнения.Содержит Тогда
		ОтборКомпоновщикаВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	Иначе
        ОтборКомпоновщикаВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    КонецЕсли;
	
	Возврат ОтборКомпоновщикаВидСравнения
КонецФункции
